perf_test/perf_01_nodebug.txt
====== SET ======
  100000 requests completed in 7.89 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.063 milliseconds (cumulative count 3)
50.000% <= 1.847 milliseconds (cumulative count 50160)
75.000% <= 3.575 milliseconds (cumulative count 75084)
87.500% <= 5.367 milliseconds (cumulative count 87545)
93.750% <= 7.287 milliseconds (cumulative count 93752)
96.875% <= 9.223 milliseconds (cumulative count 96875)
98.438% <= 11.319 milliseconds (cumulative count 98438)
99.219% <= 13.679 milliseconds (cumulative count 99221)
99.609% <= 15.831 milliseconds (cumulative count 99610)
99.805% <= 18.079 milliseconds (cumulative count 99805)
99.902% <= 21.839 milliseconds (cumulative count 99903)
99.951% <= 26.671 milliseconds (cumulative count 99952)
99.976% <= 455.935 milliseconds (cumulative count 99976)
99.988% <= 1703.935 milliseconds (cumulative count 99988)
99.994% <= 3000.319 milliseconds (cumulative count 100000)
100.000% <= 3000.319 milliseconds (cumulative count 100000)

Cumulative distribution of latencies:
2.007% <= 0.103 milliseconds (cumulative count 2007)
2.554% <= 0.207 milliseconds (cumulative count 2554)
3.219% <= 0.303 milliseconds (cumulative count 3219)
8.159% <= 0.407 milliseconds (cumulative count 8159)
8.778% <= 0.503 milliseconds (cumulative count 8778)
10.438% <= 0.607 milliseconds (cumulative count 10438)
12.754% <= 0.703 milliseconds (cumulative count 12754)
13.581% <= 0.807 milliseconds (cumulative count 13581)
14.959% <= 0.903 milliseconds (cumulative count 14959)
15.975% <= 1.007 milliseconds (cumulative count 15975)
17.258% <= 1.103 milliseconds (cumulative count 17258)
19.334% <= 1.207 milliseconds (cumulative count 19334)
21.029% <= 1.303 milliseconds (cumulative count 21029)
23.557% <= 1.407 milliseconds (cumulative count 23557)
25.952% <= 1.503 milliseconds (cumulative count 25952)
30.430% <= 1.607 milliseconds (cumulative count 30430)
36.720% <= 1.703 milliseconds (cumulative count 36720)
46.305% <= 1.807 milliseconds (cumulative count 46305)
54.580% <= 1.903 milliseconds (cumulative count 54580)
59.135% <= 2.007 milliseconds (cumulative count 59135)
60.447% <= 2.103 milliseconds (cumulative count 60447)
66.224% <= 3.103 milliseconds (cumulative count 66224)
80.925% <= 4.103 milliseconds (cumulative count 80925)
84.713% <= 5.103 milliseconds (cumulative count 84713)
90.121% <= 6.103 milliseconds (cumulative count 90121)
93.162% <= 7.103 milliseconds (cumulative count 93162)
95.184% <= 8.103 milliseconds (cumulative count 95184)
96.732% <= 9.103 milliseconds (cumulative count 96732)
97.472% <= 10.103 milliseconds (cumulative count 97472)
98.350% <= 11.103 milliseconds (cumulative count 98350)
98.682% <= 12.103 milliseconds (cumulative count 98682)
99.100% <= 13.103 milliseconds (cumulative count 99100)
99.343% <= 14.103 milliseconds (cumulative count 99343)
99.502% <= 15.103 milliseconds (cumulative count 99502)
99.639% <= 16.103 milliseconds (cumulative count 99639)
99.734% <= 17.103 milliseconds (cumulative count 99734)
99.806% <= 18.111 milliseconds (cumulative count 99806)
99.842% <= 19.103 milliseconds (cumulative count 99842)
99.874% <= 20.111 milliseconds (cumulative count 99874)
99.889% <= 21.103 milliseconds (cumulative count 99889)
99.907% <= 22.111 milliseconds (cumulative count 99907)
99.922% <= 23.103 milliseconds (cumulative count 99922)
99.934% <= 24.111 milliseconds (cumulative count 99934)
99.941% <= 25.103 milliseconds (cumulative count 99941)
99.949% <= 26.111 milliseconds (cumulative count 99949)
99.954% <= 27.103 milliseconds (cumulative count 99954)
99.956% <= 28.111 milliseconds (cumulative count 99956)
99.958% <= 29.103 milliseconds (cumulative count 99958)
99.960% <= 30.111 milliseconds (cumulative count 99960)
99.961% <= 31.103 milliseconds (cumulative count 99961)
99.964% <= 34.111 milliseconds (cumulative count 99964)
99.965% <= 37.119 milliseconds (cumulative count 99965)
99.966% <= 212.223 milliseconds (cumulative count 99966)
99.967% <= 216.191 milliseconds (cumulative count 99967)
99.968% <= 222.207 milliseconds (cumulative count 99968)
99.969% <= 228.223 milliseconds (cumulative count 99969)
99.970% <= 235.135 milliseconds (cumulative count 99970)
99.971% <= 244.223 milliseconds (cumulative count 99971)
99.972% <= 423.167 milliseconds (cumulative count 99972)
99.973% <= 431.103 milliseconds (cumulative count 99973)
99.974% <= 435.199 milliseconds (cumulative count 99974)
99.975% <= 446.207 milliseconds (cumulative count 99975)
99.976% <= 456.191 milliseconds (cumulative count 99976)
99.977% <= 464.127 milliseconds (cumulative count 99977)
99.978% <= 467.199 milliseconds (cumulative count 99978)
99.979% <= 844.287 milliseconds (cumulative count 99979)
99.980% <= 848.383 milliseconds (cumulative count 99980)
99.981% <= 864.255 milliseconds (cumulative count 99981)
99.982% <= 885.247 milliseconds (cumulative count 99982)
99.983% <= 905.215 milliseconds (cumulative count 99983)
99.984% <= 914.431 milliseconds (cumulative count 99984)
99.985% <= 1670.143 milliseconds (cumulative count 99985)
99.986% <= 1688.575 milliseconds (cumulative count 99986)
99.987% <= 1695.743 milliseconds (cumulative count 99987)
99.988% <= 1703.935 milliseconds (cumulative count 99988)
99.990% <= 1723.391 milliseconds (cumulative count 99990)
100.000% <= 3000.319 milliseconds (cumulative count 100000)
100.000% <= 3000.319 milliseconds (cumulative count 100000)

Summary:
  throughput summary: 12677.48 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        3.341     0.056     1.847     7.935    12.687  3000.319
====== GET ======
  100000 requests completed in 14.23 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.063 milliseconds (cumulative count 30)
50.000% <= 1.551 milliseconds (cumulative count 50023)
75.000% <= 3.007 milliseconds (cumulative count 75067)
87.500% <= 4.519 milliseconds (cumulative count 87502)
93.750% <= 6.135 milliseconds (cumulative count 93758)
96.875% <= 7.719 milliseconds (cumulative count 96879)
98.438% <= 9.455 milliseconds (cumulative count 98439)
99.219% <= 11.471 milliseconds (cumulative count 99222)
99.609% <= 13.223 milliseconds (cumulative count 99611)
99.805% <= 15.455 milliseconds (cumulative count 99805)
99.902% <= 18.527 milliseconds (cumulative count 99903)
99.951% <= 23.823 milliseconds (cumulative count 99952)
99.976% <= 841.215 milliseconds (cumulative count 99976)
99.988% <= 3000.319 milliseconds (cumulative count 100000)
100.000% <= 3000.319 milliseconds (cumulative count 100000)

Cumulative distribution of latencies:
2.546% <= 0.103 milliseconds (cumulative count 2546)
3.545% <= 0.207 milliseconds (cumulative count 3545)
8.632% <= 0.303 milliseconds (cumulative count 8632)
9.814% <= 0.407 milliseconds (cumulative count 9814)
13.387% <= 0.503 milliseconds (cumulative count 13387)
14.609% <= 0.607 milliseconds (cumulative count 14609)
16.179% <= 0.703 milliseconds (cumulative count 16179)
17.329% <= 0.807 milliseconds (cumulative count 17329)
18.838% <= 0.903 milliseconds (cumulative count 18838)
21.018% <= 1.007 milliseconds (cumulative count 21018)
23.041% <= 1.103 milliseconds (cumulative count 23041)
26.337% <= 1.207 milliseconds (cumulative count 26337)
30.097% <= 1.303 milliseconds (cumulative count 30097)
37.084% <= 1.407 milliseconds (cumulative count 37084)
45.350% <= 1.503 milliseconds (cumulative count 45350)
54.817% <= 1.607 milliseconds (cumulative count 54817)
59.635% <= 1.703 milliseconds (cumulative count 59635)
61.260% <= 1.807 milliseconds (cumulative count 61260)
61.886% <= 1.903 milliseconds (cumulative count 61886)
62.314% <= 2.007 milliseconds (cumulative count 62314)
62.752% <= 2.103 milliseconds (cumulative count 62752)
77.413% <= 3.103 milliseconds (cumulative count 77413)
83.826% <= 4.103 milliseconds (cumulative count 83826)
90.234% <= 5.103 milliseconds (cumulative count 90234)
93.640% <= 6.103 milliseconds (cumulative count 93640)
95.539% <= 7.103 milliseconds (cumulative count 95539)
97.338% <= 8.103 milliseconds (cumulative count 97338)
98.168% <= 9.103 milliseconds (cumulative count 98168)
98.667% <= 10.103 milliseconds (cumulative count 98667)
99.124% <= 11.103 milliseconds (cumulative count 99124)
99.418% <= 12.103 milliseconds (cumulative count 99418)
99.592% <= 13.103 milliseconds (cumulative count 99592)
99.690% <= 14.103 milliseconds (cumulative count 99690)
99.775% <= 15.103 milliseconds (cumulative count 99775)
99.834% <= 16.103 milliseconds (cumulative count 99834)
99.874% <= 17.103 milliseconds (cumulative count 99874)
99.898% <= 18.111 milliseconds (cumulative count 99898)
99.913% <= 19.103 milliseconds (cumulative count 99913)
99.924% <= 20.111 milliseconds (cumulative count 99924)
99.932% <= 21.103 milliseconds (cumulative count 99932)
99.941% <= 22.111 milliseconds (cumulative count 99941)
99.948% <= 23.103 milliseconds (cumulative count 99948)
99.952% <= 24.111 milliseconds (cumulative count 99952)
99.955% <= 25.103 milliseconds (cumulative count 99955)
99.958% <= 26.111 milliseconds (cumulative count 99958)
99.961% <= 27.103 milliseconds (cumulative count 99961)
99.962% <= 33.119 milliseconds (cumulative count 99962)
99.963% <= 211.199 milliseconds (cumulative count 99963)
99.964% <= 213.119 milliseconds (cumulative count 99964)
99.965% <= 217.215 milliseconds (cumulative count 99965)
99.966% <= 219.135 milliseconds (cumulative count 99966)
99.967% <= 222.207 milliseconds (cumulative count 99967)
99.968% <= 226.175 milliseconds (cumulative count 99968)
99.969% <= 413.183 milliseconds (cumulative count 99969)
99.970% <= 415.231 milliseconds (cumulative count 99970)
99.971% <= 424.191 milliseconds (cumulative count 99971)
99.972% <= 433.151 milliseconds (cumulative count 99972)
99.973% <= 435.199 milliseconds (cumulative count 99973)
99.974% <= 439.295 milliseconds (cumulative count 99974)
99.975% <= 833.535 milliseconds (cumulative count 99975)
99.976% <= 841.215 milliseconds (cumulative count 99976)
99.977% <= 846.335 milliseconds (cumulative count 99977)
99.978% <= 849.407 milliseconds (cumulative count 99978)
99.979% <= 854.527 milliseconds (cumulative count 99979)
99.980% <= 863.231 milliseconds (cumulative count 99980)
99.981% <= 1671.167 milliseconds (cumulative count 99981)
99.982% <= 1674.239 milliseconds (cumulative count 99982)
99.983% <= 1682.431 milliseconds (cumulative count 99983)
99.984% <= 1695.743 milliseconds (cumulative count 99984)
99.985% <= 1701.887 milliseconds (cumulative count 99985)
99.986% <= 1713.151 milliseconds (cumulative count 99986)
100.000% <= 3000.319 milliseconds (cumulative count 100000)
100.000% <= 3000.319 milliseconds (cumulative count 100000)

Summary:
  throughput summary: 7026.42 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        2.961     0.056     1.551     6.591    10.711  3000.319